RuanJG/stm32App/source/app/app_motor.c
#include "main_config.h"
#include "bsp.h"
#include "stm32f10x.h"
#include "uart.h"
#include "protocol.h"
#include "systick.h"
#include "iap.h"
#include "pwm.h"
#include "LCD1602.h"
#include "hw_config.h"
#include "switcher.h"
#if BOARD_MOTOR


#define _LOG(X...) if( 1 ) printf(X);



volatile char current_point = 0 ; // 0 motor1 round ; 1 motor1 speed ; 2 motor2 round; 3 motor2 speed



Uart_t Uart1;
//Uart_t Uart2;
//Uart_t Uart3;

#define CONSOLE_UART &Uart1
#define IAP_UART &Uart1



void Uart_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	
	//USART1								  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
    										  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure); 

	Uart_Configuration (&Uart1, USART1, 57600, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No);

	//swd
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);



}






#define ADC_SAMPLE_COUNT 32  // 2^5 = 32 , 32+2( min max )= 34  ; (sum-min-max)>>5 == (sum-min-max)/32
#define ADC_SAMPLE_CHANNEL_COUNT 1
static unsigned short escADCConvert[ADC_SAMPLE_COUNT][ADC_SAMPLE_CHANNEL_COUNT];
volatile int adc_updated;

void ADC_Configuration ()
{										 
	ADC_InitTypeDef ADC_InitStructure;
	DMA_InitTypeDef DMA_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1,ENABLE);	
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);	

	
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
	ADC_InitStructure.ADC_ScanConvMode = ENABLE;
	ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_NbrOfChannel = ADC_SAMPLE_CHANNEL_COUNT;
	ADC_Init(ADC1, &ADC_InitStructure);
	
	// 239.5 sampleTime => (239.5+12.5)/12M = 21us; 21*ADC_SAMPLE_COUNT * 3 = ADC_SAMPLE_COUNT * 63us = 1.890ms each group
	// 71.5 smapleTime => 7us; 7us*ADC_SAMPLE_COUNT*3 = ADC_SAMPLE_COUNT* 21us = 0.630 ms 
	ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_239Cycles5);//ADC_SampleTime_71Cycles5	
 
	// set ADC channel for temperature sensor
	//ADC_TempSensorVrefintCmd(ENABLE);
	
	ADC_DMACmd(ADC1, ENABLE);  
	ADC_Cmd(ADC1, ENABLE);
 
	ADC_ResetCalibration(ADC1);
	while(ADC_GetResetCalibrationStatus(ADC1));

	ADC_StartCalibration(ADC1);
	while(ADC_GetCalibrationStatus(ADC1));
 	ADC_SoftwareStartConvCmd(ADC1, ENABLE);

	
	DMA_DeInit(DMA1_Channel1);
	DMA_InitStructure.DMA_PeripheralBaseAddr = (unsigned int)&(ADC1->DR);	
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
	DMA_InitStructure.DMA_BufferSize = ADC_SAMPLE_CHANNEL_COUNT*ADC_SAMPLE_COUNT;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryBaseAddr = (unsigned int)&escADCConvert;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;

	DMA_Init(DMA1_Channel1, &DMA_InitStructure);
	DMA_ITConfig(DMA1_Channel1, DMA_IT_TC,ENABLE);
	DMA_Cmd(DMA1_Channel1, ENABLE);


  /* Enable DMA channel1 IRQ Channel */
	NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = CUSTOM_DAM1_IRQ_PREPRIORITY;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = CUSTOM_DAM1_IRQ_SUBPRIORITY;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
	adc_updated = 0;

}

void DMA1_Channel1_IRQHandler(void)
{
 if(DMA_GetITStatus(DMA1_IT_TC1))
 {
	 adc_updated = 1;
	 DMA_ClearITPendingBit(DMA1_IT_GL1);
 }
}


unsigned short Cali_Adc_Value()
{
	int i;
	u32 sensor = 0; 	
	for(i=0;i<ADC_SAMPLE_COUNT;i++)
	{
		sensor += escADCConvert[i][0];
	}
	sensor = sensor>>5;
	return sensor;
}




#define ACCEL_MAX 100
#define ACCEL_MIN 0
volatile int adc_accel;
int accel_check_even()
{
	int accel;
	
	if( adc_updated == 0 ){
		return adc_accel;
	}
	accel = Cali_Adc_Value();
	_LOG("adc=%d\n",accel);
	accel = accel*3300/4096;
	adc_accel = (ACCEL_MAX - ACCEL_MIN)*accel/ (3300/2);
	_LOG("accel=%d\n",adc_accel);
}





#define MAX_FREQ 1000
#define LIMIT_MAX_SPEED 180 // round/min
#define LIMIT_MAX_FREQ 1200 // LIMIT_MAX_SPEED / 60 *400
#define LIMIT_MIN_FREQ 1
#define ONE_ROUND_FREQ 400  //xi feng 
#define LIMIT_MAX_ROUND_COUNT 99
#define LIMIT_MIN_ROUND_COUNT 1
#define RATE_FREQ 300
#define MOTOR_LOOP_INTERVAL_MS 10
#define MOTOR1_ID 1
#define MOTOR2_ID 2
#define MOTOR_DIRECTION_RIGHT 	Bit_RESET
#define MOTOR_DIRECTION_LEFT 		Bit_SET
#define MOTOR_EN_ON  Bit_RESET
#define MOTOR_EN_OFF Bit_SET

#define DERATE_ACCLE 400
float deaccle;

struct motor {
	unsigned short expect_speed;
	unsigned short expect_freq;
	unsigned short current_freq;
	unsigned short id;
	unsigned int   current_pulse;
	unsigned int   expect_pulse;
	unsigned int   rate_reduce_pulse_point;
	unsigned int   rate_reduce_expect_freq;
	float          accelerate_freq;
	float					 accel;
	//pwm pin
	GPIO_TypeDef* pGPIOx;
	uint16_t pGPIO_pin;
	//pwm
	unsigned char channel;
	TIM_TypeDef* timer ;
	//dir pin
	GPIO_TypeDef* dGPIOx;
	uint16_t dGPIO_pin;
	//en pin
	GPIO_TypeDef* eGPIOx;
	uint16_t eGPIO_pin;
};

volatile struct motor motor1;
volatile struct motor motor2;
systick_time_t motor_timer;


void motor_set_direct(volatile struct motor *motorx , unsigned char direction) 
{
	GPIO_WriteBit( motorx->dGPIOx , motorx->dGPIO_pin, (BitAction) direction);
}

void motor_en(volatile struct motor *motorx , unsigned char en)
{
	GPIO_WriteBit( motorx->eGPIOx , motorx->eGPIO_pin, (BitAction) en);
}


int motor_rate(volatile struct motor *motorx, unsigned short freq)
{
	unsigned short period;
	GPIO_InitTypeDef GPIO_InitStructure;
	
	if( freq < LIMIT_MIN_FREQ ){
		// stop 
		TIM_Cmd(motorx->timer, DISABLE);
		#if 0
		GPIO_InitStructure.GPIO_Pin=motorx->pGPIO_pin;
		GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
		GPIO_Init(motorx->pGPIOx, &GPIO_InitStructure);
		GPIO_WriteBit(motorx->pGPIOx,motorx->pGPIO_pin, Bit_RESET);
		#endif
		//pwm_set( motorx->timer, motorx->channel, 0);
		_LOG("Motor%d set freq(%d)\n", motorx->id, freq);
		
