RuanJG/stm32App/source/app/app_motor.c
	}else if( freq <= LIMIT_MAX_FREQ) {
		//set freq
		period = SystemCoreClock / (motorx->timer->PSC+1) / freq; 
		TIM_SetAutoreload( motorx->timer , period );
		pwm_set(motorx->timer , motorx->channel , 10);
		TIM_Cmd(motorx->timer, ENABLE);
		#if 0
		GPIO_InitStructure.GPIO_Pin=motorx->pGPIO_pin;
		GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP ;
		GPIO_Init(motorx->pGPIOx, &GPIO_InitStructure);
		#endif
		
		_LOG("Motor%d set freq(%d), start...\n", motorx->id, freq);
	}else{
		_LOG("Motor%d set freq(%d) error\n", motorx->id, freq); 
		return -1;
	}
	
	motorx->current_freq = freq;
	return 0;
}


void motor_hw_init(volatile struct motor *motorx)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	//pwm
	GPIO_InitStructure.GPIO_Pin=motorx->pGPIO_pin;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP ;
	GPIO_Init(motorx->pGPIOx, &GPIO_InitStructure);
	//default pwm=0 , set freq at max  ; motor controler freq 0-200KHZ , limit at [0,1000] hz
	pwm_init(motorx->timer, motorx->channel, 20 ,  MAX_FREQ , 1 , 1); 
	TIM_ARRPreloadConfig( motorx->timer, ENABLE);
	switch( motorx->channel ){
	case 1:
		TIM_OC1PreloadConfig( motorx->timer, TIM_OCPreload_Enable);
		break;
	case 2:
		TIM_OC2PreloadConfig( motorx->timer, TIM_OCPreload_Enable);
		break;
	case 3:
		TIM_OC3PreloadConfig( motorx->timer, TIM_OCPreload_Enable);
		break;
	case 4:
		TIM_OC4PreloadConfig( motorx->timer, TIM_OCPreload_Enable);
		break;
	}

	//en pin
	GPIO_InitStructure.GPIO_Pin=motorx->eGPIO_pin;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(motorx->eGPIOx, &GPIO_InitStructure);
	motor_en( motorx, MOTOR_EN_OFF);
	
	//dir pin
	GPIO_InitStructure.GPIO_Pin=motorx->dGPIO_pin;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(motorx->dGPIOx, &GPIO_InitStructure);
	//motor_set_direct( motorx, motorx->direction);
	
	motor_rate(motorx, motorx->expect_freq);
}

void TIM2_IRQHandler()
{
	if( SET == TIM_GetITStatus(TIM2, TIM_IT_CC3 ) )
	{
		motor2.current_pulse++;
		if( motor2.current_pulse >= motor2.expect_pulse ){
			motor2.current_pulse = motor2.expect_pulse;
			motor_rate( &motor2, 0 );
		}
		TIM_ClearITPendingBit(TIM2, TIM_IT_CC3);
	}else{
		//break here
		TIM_ClearITPendingBit(TIM2, 0xFF);
	}
}

void TIM3_IRQHandler()
{
	//if( SET == TIM_GetITStatus(TIM3 , TIM_IT_Update) )
	if( SET == TIM_GetITStatus(TIM3, TIM_IT_CC2 ) )
	{
		motor1.current_pulse++;
		if( motor1.current_pulse >= motor1.expect_pulse ){
			motor1.current_pulse = motor1.expect_pulse;
			motor_rate( &motor1, 0 );
		}
		TIM_ClearITPendingBit(TIM3, TIM_IT_CC2);
	}else{
		//break here
		TIM_ClearITPendingBit(TIM3, 0xFF);
	}
}

void motor_rate_check_even( volatile struct motor *motorx )
{
	int freq, exfreq;
	
	// has been stop
	if( motorx->current_pulse >= motorx->expect_pulse ){
		//systick_delay_us(500000);
		motor_en( motorx, MOTOR_EN_OFF);
		return;
	}
	
	//if time to reduce speed 
	if( motorx->current_pulse >= motorx->rate_reduce_pulse_point ) {
			motorx->expect_freq = motorx->rate_reduce_expect_freq;//motorx->accelerate_freq*1000;
	}
	
	// has been average speed
	if( motorx->current_freq == motorx->expect_freq ){
		motorx->accel = 0;
		return;
	}
	
	// add or reduce speed
	exfreq = motorx->expect_freq;

	if( motorx->current_freq < exfreq )
	{
		
	motorx->accel += (motorx->accelerate_freq*MOTOR_LOOP_INTERVAL_MS) ;
	freq = motorx->accel; // 去小数
	motorx->accel -= freq;
		
		freq += motorx->current_freq;// add rate
		freq = (freq < exfreq) ? freq: exfreq;
	}else{
		
	motorx->accel += (deaccle *MOTOR_LOOP_INTERVAL_MS) ;
	freq = motorx->accel; // 去小数
	motorx->accel -= freq;
		
		freq = motorx->current_freq - freq;// reduce rate
		freq = (freq >= exfreq) ? freq: exfreq;
	}
	
	
	if( freq != motorx->current_freq &&  freq >= LIMIT_MIN_FREQ && freq <= LIMIT_MAX_FREQ ){
		motor_rate( motorx, freq );
	}else{
		//call error
	}
	
	
}



void motor_init()
{
	NVIC_InitTypeDef NVIC_InitStructure;
	
	motor1.id = MOTOR1_ID;
	motor1.expect_speed = 0;
	motor1.expect_freq = 0;
	motor1.current_freq = 0;
	motor1.expect_pulse = 0;
	motor1.current_pulse = 0;
	//pwm pin
	motor1.pGPIOx = GPIOA;
	motor1.pGPIO_pin = GPIO_Pin_7;
	//pwm
	motor1.channel = 2;
	motor1.timer = TIM3;
	//dir pin
	motor1.dGPIOx = GPIOA ;
	motor1.dGPIO_pin = GPIO_Pin_6;
	//en pin
	motor1.eGPIOx = GPIOA;
	motor1.eGPIO_pin = GPIO_Pin_15;
	
	
	
	motor2.id = MOTOR2_ID;
	motor2.expect_speed = 0;
	motor2.expect_freq = 0;
	motor2.current_freq = 0;
	motor2.expect_pulse = 0;
	motor2.current_pulse = 0;
	//pwm pin
	motor2.pGPIOx = GPIOA;
	motor2.pGPIO_pin = GPIO_Pin_2;
	//pwm
	motor2.channel = 3;
	motor2.timer = TIM2;
	//dir pin
	motor2.dGPIOx = GPIOA ;
	motor2.dGPIO_pin = GPIO_Pin_1;
	//en pin
	motor2.eGPIOx = GPIOA;
	motor2.eGPIO_pin = GPIO_Pin_3;
	
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB |RCC_APB2Periph_AFIO , ENABLE);
	motor_hw_init(&motor1);
	motor_hw_init(&motor2);
	
	NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = CUSTOM_CAN1_IRQ_PREPRIORITY; 
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = CUSTOM_CAN1_IRQ_SUBPRIORITY; 
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
	NVIC_Init(&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
	NVIC_Init(&NVIC_InitStructure);
	
	systick_init_timer( &motor_timer , MOTOR_LOOP_INTERVAL_MS );
	
}





void motor_loop()
{
	if( systick_check_timer( &motor_timer ) ){
		motor_rate_check_even(&motor1);
		motor_rate_check_even(&motor2);
	}
	
}


void motor_start(volatile struct motor *motorx , unsigned int expect_freq , unsigned int expect_pulse , unsigned char direction)
{
	//加速度是  RATE_FREQ/MOTOR_LOOP_INTERVAL_MS
	// s = v0 * t + 0.5* a*t*t ; t= (v1-v0)/RATE_FREQ/MOTOR_LOOP_INTERVAL_MS
	
	//t = v/a;  
	// s = v*t/2  ==>  s = v*(v/a)/2 = (v*v)/(a*2); 
	float accel = 40; // p/ss //expect_freq*expect_freq/ONE_ROUND_FREQ ;// p/s*s
	unsigned int pulse;
	
	
	// running
	if( motorx->current_pulse < motorx->expect_pulse ){
		_LOG("motor%d start : is running , error\n", motorx->id);
		return;
	}
	// reinit parameter
	if( expect_freq > LIMIT_MAX_FREQ || expect_freq < LIMIT_MIN_FREQ ){
		_LOG("motor%d start : freq %d error\n", motorx->id, expect_freq);
		return;
	}
	if( expect_pulse > (LIMIT_MAX_ROUND_COUNT*ONE_ROUND_FREQ) || expect_pulse < (LIMIT_MIN_ROUND_COUNT*ONE_ROUND_FREQ) ){
		_LOG("motor%d start : round count error\n", motorx->id);
		return;
	}
	
	
	accel = RATE_FREQ;//RATE_FREQ * expect_freq /120; //  根据速度与参考速度的比例 ，调整加速时间 
	//accel = accel_check_even();
	deaccle = (float)DERATE_ACCLE/1000;
	pulse = expect_freq*expect_freq/2/(DERATE_ACCLE);
	if( (pulse*2) < expect_pulse ){
		motorx->rate_reduce_pulse_point = expect_pulse- pulse;
	}else{
		motorx->rate_reduce_pulse_point = expect_pulse/2;
	}
	
