RuanJG/stm32App/source/app/app_motor.c
	motorx->rate_reduce_expect_freq = 30;//10;
	motorx->accelerate_freq = accel/1000 ;//MOTOR_LOOP_INTERVAL_MS*a/1000; //=RATE_FREQ;
	motorx->accel = 0;
	
	motorx->expect_freq = expect_freq;
	motorx->expect_pulse = expect_pulse;
	motorx->current_pulse = 0;
	motorx->current_freq = 10;
	
	_LOG("expect_pulse=%d, accel=%f, accel_pulse=%d,rate_reduce_pulse=%d, expect_freq = %d\n", expect_pulse, accel,pulse, motorx->rate_reduce_pulse_point, expect_freq);
	
	motor_set_direct( motorx, direction);
	motor_en( motorx, MOTOR_EN_ON);
	systick_delay_us(500000);
}


void motor_stop(volatile struct motor *motorx)
{
	unsigned int pulse;
	
		// has stoped
	if( motorx->current_pulse >= motorx->expect_pulse )
		return;
	
	//goto the reduce rate state
	if( motorx->current_pulse < motorx->rate_reduce_pulse_point ){
		deaccle = 0.7;
		pulse = motorx->current_freq *motorx->current_freq/2/(deaccle*1000);
		motorx->current_pulse = 1;
		motorx->expect_pulse = pulse;
		motorx->rate_reduce_pulse_point = 0;
		//if( motorx->current_freq < motorx->accelerate_freq*1000 )			motorx->current_pulse = motorx->expect_pulse;
	}
}






#if defined (STM32F10X_HD) || defined (STM32F10X_HD_VL) || defined (STM32F10X_CL) || defined (STM32F10X_XL)
  #define FLASH_PAGE_SIZE    ((uint16_t)0x800)
#else
  #define FLASH_PAGE_SIZE    ((uint16_t)0x400)
#endif
#define CONFIG_ADDRESS (0x8010000-FLASH_PAGE_SIZE)
#define CONFIG_SOTRE_SIZE FLASH_PAGE_SIZE

// the size of struct config should be n*4Byte
struct config {
	int config_avaliable;
	int motor1_speed;
	int motor1_circle_count;
	int motor1_direction;
	int motor2_speed;
	int motor2_circle_count;
	int motor2_direction;
};
volatile struct config g_config;
systick_time_t auto_save_config_timer;

void config_read()
{
	volatile int * p;
	__IO int* addr;
	int i, int_count;
	
	addr = (__IO int*) CONFIG_ADDRESS;
	int_count = sizeof( struct config )/sizeof( int );	
	p = (volatile int*)&g_config;
	for( i=0; i< int_count  ; i++ ){
		*(p+i) = *(__IO int*) addr;
		addr++;
	}
	
}

int config_save()
{
	int timeout, i, res;
	volatile FLASH_Status FLASHStatus = FLASH_COMPLETE;
	volatile int * data = (volatile int *) &g_config;
	int addr = CONFIG_ADDRESS;
	int int_count = sizeof( struct config )/sizeof( int );
	
	g_config.config_avaliable = 1;
		
	FLASHStatus = FLASH_COMPLETE;
	FLASH_Unlock();
	FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);
	
	res = 0;
	timeout = 10;
	while( timeout-- > 0)
	{
		FLASHStatus = FLASH_ErasePage(addr);
		if( FLASHStatus == FLASH_COMPLETE ){
			res = 1;
			break;
		}
	}
	
	if( res == 1 )
	{
		for ( i = 0; i< int_count ; i++ )
		{
			res = 0;
			timeout = 10;
			while( timeout-- > 0)
			{
				FLASHStatus = FLASH_ProgramWord( addr+4*i, *(data+i) ) ;//FLASH_ProgramOptionByteData(IAP_TAG_ADDRESS,tag);
				if( FLASHStatus == FLASH_COMPLETE ){
					res = 1;
					break;
				}
			}
			if( res == 0 ) break;
		}
	}

	FLASH_Lock();
	
	return res;
}


void config_init()
{
	//if no this setting , flash will very slow
	//FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);
	g_config.config_avaliable = 0;
	config_read();
	if( g_config.config_avaliable != 1 ){
		// never init
		g_config.config_avaliable = 1;
		g_config.motor1_circle_count = 0;
		g_config.motor1_direction = MOTOR_DIRECTION_LEFT;
		g_config.motor1_speed = 0;
		g_config.motor2_circle_count = 0;
		g_config.motor2_direction = MOTOR_DIRECTION_LEFT;
		g_config.motor2_speed = 0;
		
		config_save();
	}
	systick_init_timer( &auto_save_config_timer , 1000 );
}

void config_auto_save_even()
{
	if( systick_check_timer( & auto_save_config_timer ) && g_config.config_avaliable == 2){
		config_save();
	}
}






#define M1_SPEED_DATA_X 0
#define M1_SPEED_DATA_Y 11 
#define M1_ROUND_DATA_X 0
#define M1_ROUND_DATA_Y 6
#define M1_DERECTION_X	0
#define M1_DERECTION_Y	15

#define M2_SPEED_DATA_X 1
#define M2_SPEED_DATA_Y 11 
#define M2_ROUND_DATA_X 1
#define M2_ROUND_DATA_Y 6
#define M2_DERECTION_X	1
#define M2_DERECTION_Y	15

#define lcd_update_m1_round( )		_LOG( "r1=%d\n",g_config.motor1_circle_count);lcd_display_number( M1_ROUND_DATA_X , M1_ROUND_DATA_Y , g_config.motor1_circle_count, 2 )
#define lcd_update_m1_speed( )		_LOG( "s1=%d\n",g_config.motor1_speed);lcd_display_number( M1_SPEED_DATA_X, M1_SPEED_DATA_Y , g_config.motor1_speed, 3)
#define lcd_update_m2_round( )		_LOG( "r2=%d\n",g_config.motor2_circle_count);lcd_display_number( M2_ROUND_DATA_X , M2_ROUND_DATA_Y , g_config.motor2_circle_count, 2)
#define lcd_update_m2_speed( )		_LOG( "s2=%d\n",g_config.motor2_speed);lcd_display_number( M2_SPEED_DATA_X, M2_SPEED_DATA_Y , g_config.motor2_speed, 3 )
void lcd_update_m1_direction()
{
	if( g_config.motor1_direction==MOTOR_DIRECTION_RIGHT ){
		_LOG( "d1=right\n"); 
		LCD1602_Write(M1_DERECTION_X, M1_DERECTION_Y, 'R');
	}else{
		_LOG( "d1=left\n"); 
		LCD1602_Write(M1_DERECTION_X, M1_DERECTION_Y, 'L');
	}
}

void lcd_update_m2_direction()
{
	if( g_config.motor2_direction==MOTOR_DIRECTION_RIGHT ){
		_LOG( "d2=right\n"); 
		LCD1602_Write(M2_DERECTION_X, M2_DERECTION_Y, 'R');
	}else{
		_LOG( "d2=left\n"); 
		LCD1602_Write(M2_DERECTION_X, M2_DERECTION_Y, 'L');
	}
}

unsigned char lcd_data[2][16] = {
	{'M','1',' ',' ','R',':',' ',' ',' ','S',':',' ',' ',' ',' ',' '},
	{'M','2',' ',' ','R',':',' ',' ',' ','S',':',' ',' ',' ',' ',' '},
};



void lcd_display_number( int x, int y, int number, int count)
{
	for( ; count >0 ; count--)
	{
		LCD1602_Write(x, y+count-1, '0'+ number%10 );
		number/=10;
	}
}

void lcd_update_mouse()
{
	switch( current_point ){
		case 0 :
			LCD1602_SetMouse( M1_ROUND_DATA_X, M1_ROUND_DATA_Y+1);
			break;
			
		case 1:
			LCD1602_SetMouse( M1_SPEED_DATA_X, M1_SPEED_DATA_Y+2);
			break;
			
		case 2 :
			LCD1602_SetMouse( M1_DERECTION_X, M1_DERECTION_Y);
			break;
			
		case 3:
			LCD1602_SetMouse( M2_ROUND_DATA_X, M2_ROUND_DATA_Y+1);
			break;
		case 4:
			LCD1602_SetMouse( M2_SPEED_DATA_X, M2_SPEED_DATA_Y+2);
			break;
		
		case 5:
			LCD1602_SetMouse( M2_DERECTION_X, M2_DERECTION_Y);
			break;
		
		default:
			current_point = 0;
			break;
	}
}


void lcd_init()
{
	int x,y;
	LCD1602_Init();
	
	for( x=0; x<2 ; x++){
		for( y=0; y< 16; y++)
			LCD1602_Write( x, y, lcd_data[x][y] );
	}
	
	if( g_config.config_avaliable ){
		lcd_update_m1_round();
		lcd_update_m1_speed();
		lcd_update_m2_round();
		lcd_update_m2_speed();
	}

	lcd_update_m2_direction();
	lcd_update_m1_direction();
	
	lcd_update_mouse();
}






void round_add_key_toggle_handler()
{
	switch( current_point ){
		case 0 :
			if( g_config.motor1_circle_count < LIMIT_MAX_ROUND_COUNT ){
				g_config.motor1_circle_count++;
				g_config.config_avaliable = 2;
			}
			lcd_update_m1_round();
			break;
			
		case 1:
			g_config.motor1_speed = g_config.motor1_speed+2 > LIMIT_MAX_SPEED ? LIMIT_MAX_SPEED: g_config.motor1_speed+2 ;
			g_config.config_avaliable = 2;
			lcd_update_m1_speed();
			break;
			
		case 2 :
			g_config.motor1_direction = g_config.motor1_direction == MOTOR_DIRECTION_LEFT ? MOTOR_DIRECTION_RIGHT:MOTOR_DIRECTION_LEFT;
			lcd_update_m1_direction();
			g_config.config_avaliable = 2;
			break;
			
		case 3:
			if( g_config.motor2_circle_count < LIMIT_MAX_ROUND_COUNT ){
				g_config.motor2_circle_count++;
				g_config.config_avaliable = 2;
			}
			lcd_update_m2_round();
			break;
		case 4:
			g_config.motor2_speed = g_config.motor2_speed+2 > LIMIT_MAX_SPEED ? LIMIT_MAX_SPEED: g_config.motor2_speed+2 ;
			g_config.config_avaliable = 2;
			lcd_update_m2_speed();
			break;
		
		case 5:
			g_config.motor2_direction = g_config.motor2_direction == MOTOR_DIRECTION_LEFT ? MOTOR_DIRECTION_RIGHT:MOTOR_DIRECTION_LEFT;
			lcd_update_m2_direction();
			g_config.config_avaliable = 2;
			break;
		
		default:
			current_point = 0;
			break;
	}
}

void round_reduce_key_toggle_handler()
{
	switch( current_point ){
		case 0 :
			if( g_config.motor1_circle_count > 0 ){
				g_config.motor1_circle_count--;
				g_config.config_avaliable = 2;
			}
			lcd_update_m1_round();
			break;
			
		case 1:
			g_config.motor1_speed = g_config.motor1_speed-2 > 0 ? g_config.motor1_speed-2 : 0 ;
			g_config.config_avaliable = 2;
			lcd_update_m1_speed();
			break;
			
		case 2 :
			g_config.motor1_direction = g_config.motor1_direction == MOTOR_DIRECTION_LEFT ? MOTOR_DIRECTION_RIGHT:MOTOR_DIRECTION_LEFT;
			lcd_update_m1_direction();
			g_config.config_avaliable = 2;
			break;
			
		case 3:
			if( g_config.motor2_circle_count > 0 ){
				g_config.motor2_circle_count--;
				g_config.config_avaliable = 2;
			}
			lcd_update_m2_round();
			break;
			
		case 4:
			g_config.motor2_speed = g_config.motor2_speed-2 > 0 ? g_config.motor2_speed-2 : 0 ;
			g_config.config_avaliable = 2;
			lcd_update_m2_speed();
			break;
		
		case 5:
			g_config.motor2_direction = g_config.motor2_direction == MOTOR_DIRECTION_LEFT ? MOTOR_DIRECTION_RIGHT:MOTOR_DIRECTION_LEFT;
			lcd_update_m2_direction();
			g_config.config_avaliable = 2;
			break;
		
		default:
			current_point = 0;
			break;
	}
}

void start_key_press_handler()
{
	if( g_config.config_avaliable == 2 )
	{
			config_save();
	}
	
	
	if( motor1.current_pulse >=  motor1.expect_pulse  && motor2.current_pulse >=  motor2.expect_pulse ){
		_LOG("start motor1 speed=%d, round=%d\n", g_config.motor1_speed , g_config.motor1_circle_count * ONE_ROUND_FREQ );
		motor_start( &motor1, g_config.motor1_speed * ONE_ROUND_FREQ /60 , g_config.motor1_circle_count * ONE_ROUND_FREQ , g_config.motor1_direction);
		_LOG("start motor2 speed=%d, round=%d\n", g_config.motor2_speed , g_config.motor2_circle_count * ONE_ROUND_FREQ );
		motor_start( &motor2, g_config.motor2_speed * ONE_ROUND_FREQ /60 , g_config.motor2_circle_count * ONE_ROUND_FREQ , g_config.motor2_direction);
	}else{ 
		_LOG("stop motor1\n");
		motor_stop( &motor1 );
		_LOG("stop motor2\n");
		motor_stop( &motor2 );
	}
	/*
	if( motor2.current_pulse >=  motor2.expect_pulse ){
		_LOG("start motor2 speed=%d, round=%d\n", g_config.motor2_speed , g_config.motor2_circle_count * ONE_ROUND_FREQ );
		motor_start( &motor2, g_config.motor2_speed * ONE_ROUND_FREQ /60 , g_config.motor2_circle_count * ONE_ROUND_FREQ );
	}else{ 
		_LOG("stop motor2\n");
		motor_stop( &motor2 );
	}
	*/
}

void switch_key_press_handler()
{
	current_point++;
	current_point %= 6;
	lcd_update_mouse();

