RuanJG/stm32App/source/app/app_motor.c
}



#define SW_INTERVAL_COUNT  10  // 10ms检查一次GPIO口， 10次就是100ms, 用作过滤
#define SW_INTERVAL_MS 5
systick_time_t sw_timer;
volatile struct switcher round_add_key,round_reduce_key,start_key,switch_key;

void switch_init()
{
	switcher_init( &round_add_key, SW_INTERVAL_COUNT, 1 , 0 , GPIOA, GPIO_Pin_5, round_add_key_toggle_handler , NULL);
	switcher_init( &round_reduce_key, SW_INTERVAL_COUNT,1, 0 , GPIOA, GPIO_Pin_4 , round_reduce_key_toggle_handler, NULL);
	switcher_init( &start_key , SW_INTERVAL_COUNT,1, 0 , GPIOB, GPIO_Pin_0, start_key_press_handler ,NULL);
	switcher_init( &switch_key, SW_INTERVAL_COUNT,1, 0 , GPIOB, GPIO_Pin_1, switch_key_press_handler ,NULL);
	systick_init_timer( &sw_timer, SW_INTERVAL_MS );
}

void switch_even()
{
	if( 0 == systick_check_timer( &sw_timer ) ) return;
	
	switcher_interval_check( &round_add_key  );
	switcher_interval_check( &round_reduce_key  );
	switcher_interval_check( &start_key );
	switcher_interval_check( &switch_key );
}























systick_time_t led_timer;

void heart_led_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	systick_init_timer(&led_timer, 500);
	
}

void heart_led_even()
{
	static BitAction led = Bit_RESET;
	
	if( systick_check_timer( &led_timer ) ){
		GPIO_WriteBit( GPIOC, GPIO_Pin_13 , led);
		led = led==Bit_RESET ? Bit_SET: Bit_RESET ;
		
		//accel_check_even();
	}
}



void cmd_even()
{
	static char buffer[4]={0};
	static char index = 0;
	
	//if( Uart_Get( CONSOLE_UART , (unsigned char*) &buffer[index], 1 ) ){
	if( USB_RxRead((unsigned char*) &buffer[index], 1 ) ){
		if( buffer[index] == ';' ){
			if( index == 1 ){
				switch( buffer[index -1 ]){
					case '+':
						_LOG("add \n");
						round_add_key_toggle_handler();
					break;
					case '-':
						_LOG("reduce \n");
						round_reduce_key_toggle_handler();
					break;
					case 's':
						_LOG("start \n");
						start_key_press_handler();
					break;
					case 'w':
						_LOG("switch \n");
						switch_key_press_handler();
					break;
				}
			}
			index = 0;
			return;
		}
		index++;
		index = index % 4;
	}
}






void app_init()
{
	Uart_init();

#if BOARD_HAS_IAP
	if( IAP_PORT_USB == 1 ) iap_init_in_usb();
	else if( IAP_PORT_CAN1 == 1 )iap_init_in_can1();
	else if( IAP_PORT_UART == 1) iap_init_in_uart( IAP_UART );
#endif
	//console_init( CONSOLE_UART_TYPE ,CONSOLE_UART );
	console_init( CONSOLE_USB_TYPE ,NULL );
	
	config_init();
	motor_init();
	lcd_init();
	switch_init();
	heart_led_init();
	
	ADC_Configuration ();
}


void app_event()
{
	motor_loop();
	switch_even();
	heart_led_even();
	cmd_even();
	config_auto_save_even();
}


#endif
